cleanli2/stm32/src/common.c
#include "stm32f10x.h"
#include "board.h"
#include "common.h"
#include "cmd.h"
#include "lprintf.h"
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include "sd/stm32_eval_spi_sd.h"
#include "os_task.h"
#include "ring_buf.h"
#include "display.h"

/** @addtogroup STM32F10x_StdPeriph_Examples
  * @{
  */

/** @addtogroup GPIO_IOToggle
  * @{
  */
extern unsigned long debug_enable;

DECLARE_OS_LOCK(oslk_evt, EVT_LOCK_NO);
DECLARE_RB_DATA(evt, rb_evt, 3)
#define TIM2_RELOAD 60000
#define COUNTS_PER_US 6

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
GPIO_InitTypeDef GPIO_InitStructure;
USART_InitTypeDef USART_InitStructure;

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

u32 last_systick;
u32 interv_systick;
static int sound_enable=1;
static uint32_t g_10ms_count = 0;
uint32_t g_ms_count = 0;
void os_task1(void*);
void os_task2(void*);
void os_task3(void*);
void compute_cpu_occp();
void os_ui(void*p)
{
    (void)p;
    struct point* ppt;
    struct point last_pt = {0xffff, 0xffff};;
    evt *dtw;

    ui_start();
    while(1){
        g_flag_1s = false;
        dtw=RB_R_GET_wait(evt, rb_evt);
        switch(dtw->type){
            case EVT_SCRN_TOUCH_UP:
                ppt = (struct point*)dtw->pkg;
                if(last_pt.px != 0xffff){
                    Proxy_TP_Draw_Big_Point(last_pt.px, last_pt.py, WHITE);
                }
                Proxy_TP_Draw_Big_Point(ppt->px, ppt->py, BLACK);
                last_pt = *ppt;
                cur_task_event_flag |= 1<<EVENT_TOUCH_UP;
                cached_touch_x = ppt->px;
                cached_touch_y = ppt->py;
                break;
            case EVT_ONE_SECOND:
                g_flag_1s = true;
                break;
            default:
                lprintf("unknow evt type\n");
        };
        RB_R_SET(evt, rb_evt);
        task_ui(NULL);
    }
}
struct emulate_touch g_fake_touch = {0};
struct emulate_touch *gftp=&g_fake_touch;
void os_touch(void*p)
{
    struct point pt;
    struct point pt_cache;
    int touch_pressed = 0;
    (void)p;
    while(1){
        if(gftp->n_pt && gftp->pts){
            u32 test_time;
            gftp->cur_interval++;
            if(gftp->cur_interval >= gftp->interval){
                gftp->cur_interval = 0;
                if(gftp->cur_n_pt >= gftp->n_pt){
                    gftp->cur_n_pt = 0;
                }
                pt_cache = gftp->pts[gftp->cur_n_pt++];
                touch_pressed = 1;
                test_time = g_ms_count-gftp->start;
                if(gftp->last*60*1000u < test_time){//test done
                    gftp->pts =NULL;
                    lprintf("##########stress test end %s\n", get_rtc_time(0));
                    lprintf("##########stress test time long %d mins %d s %d ms\n",
                            test_time/1000/60,
                            (test_time/1000)%60, test_time%1000);
                }
            }
        }
        if(touch_down()){
            touch_pressed = 1;
            if(get_TP_point(&pt.px, &pt.py)){
                //lprintf("touch: %d %d\n", pt.px, pt.py);
                pt_cache = pt;
            }
        }
        else{
            if(touch_pressed == 1){
                os_lock(&oslk_evt);
                evt *dtw=RB_W_GET_wait(evt, rb_evt);
                //do work
                dtw->type = EVT_SCRN_TOUCH_UP;
                memcpy(dtw->pkg, &pt_cache, sizeof(struct point));
                RB_W_SET(evt, rb_evt);
                os_unlock(&oslk_evt);
            }
            touch_pressed = 0;
        }
        os_10ms_delay(20);
    }
}
static inline u32 get_sp()
{
    register u32 __reg_sp __asm("sp");
    return (__reg_sp);
}

int get_sound_sta()
{
    return sound_enable;
}
void enable_sound(int en)
{
    sound_enable = en;
}
void timer_init(uint16_t arr, uint16_t psr)
{
    TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

    lprintf("arr %x psr %x\n", arr, psr);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);

    TIM_DeInit(TIM2);
    TIM_InternalClockConfig(TIM2);
    /* Time base configuration */
    TIM_TimeBaseStructure.TIM_Period = arr;
    TIM_TimeBaseStructure.TIM_Prescaler = psr;
    TIM_TimeBaseStructure.TIM_ClockDivision = 0;
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

    TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);

#if 0
    /* Output Compare Toggle Mode configuration: Channel1 */
    TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_Toggle;
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = arr/2;
    TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_Low;
    TIM_OCInitStructure.TIM_OutputNState = TIM_OutputNState_Disable;
    TIM_OCInitStructure.TIM_OCNPolarity = TIM_OCNPolarity_High;
    TIM_OCInitStructure.TIM_OCNIdleState = TIM_OCNIdleState_Set;
    TIM_OCInitStructure.TIM_OCIdleState = TIM_OCIdleState_Set;
    TIM_OC1Init(TIM2, &TIM_OCInitStructure);

    TIM_OC1PreloadConfig(TIM2, TIM_OCPreload_Disable);

    /* Output Compare Toggle Mode configuration: Channel2 */
    TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCInitStructure.TIM_Pulse = arr/4;

    TIM_OC2Init(TIM2, &TIM_OCInitStructure);

#endif

    TIM_ARRPreloadConfig(TIM2, DISABLE);

    TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
    NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* TIM enable counter */
    TIM_Cmd(TIM2, ENABLE);
}

extern os_task_timer *g_tt;
u32*SysTick_Handler_local(u32*stack_data)
{
    (void)stack_data;
    lprintf_time_buf(1, "stk+%s_%X:%X_%X_%X\n", cur_os_task->name, stack_data,
            stack_data[7],
            stack_data[8],
            stack_data[9]);
    g_ms_count++;
    /*
    u32 t = TIM_GetCounter(TIM2);
    interv_systick = t - last_systick;
    last_systick = t;
    */
    check_os_timer();
    lprintf_time_buf(1, "stk-%s_%X:%X_%X_%X\n", cur_os_task->name, stack_data,
            stack_data[7],
            stack_data[8],
            stack_data[9]);
    return stack_data;
}

void systick_init()
{
    lprintf("SystemCoreClock=%d\n", SystemCoreClock);

    SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);
    SysTick_Config(72000-1);
    NVIC_SetPriority (PendSV_IRQn, (1<<__NVIC_PRIO_BITS) - 1);
}

uint64_t get_system_us()
{
    uint64_t system_us_count;

    system_us_count = (uint64_t)g_ms_count * 1000 + (72000-1-SysTick->VAL)/72;
    return system_us_count;
}

u32*TIM2_IRQHandler_local(u32*stack_data)
{
    (void)stack_data;
    lprintf_time_buf(1, "tm2+%s_%X:%X_%X_%X\n", cur_os_task->name, stack_data,
            stack_data[7],
            stack_data[8],
            stack_data[9]);
	//if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)
    TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
    g_10ms_count++;
    sound_execute();
    //*(u32*)0xe000ed04=0x10000000;
    os_switch_trigger();
    lprintf_time_buf(1, "tm2-%s_%X:%X_%X_%X\n", cur_os_task->name, stack_data,
            stack_data[7],
            stack_data[8],
            stack_data[9]);
    return stack_data;
}

